In [1]:
import numpy as np
import pandas as pd

In [3]:
df_medianage = pd.read_csv('raw_owid_median_age_estimates.csv')

In [4]:
df_medianage.head()

,Entity,Code,Year,Median age - Sex: all - Age: all - Variant: estimates,Median age - Sex: all - Age: all - Variant: medium
0,Afghanistan,AFG,1950,18.4,NaN
1,Afghanistan,AFG,1951,18.4,NaN
2,Afghanistan,AFG,1952,18.4,NaN
3,Afghanistan,AFG,1953,18.3,NaN
4,Afghanistan,AFG,1954,18.3,NaN

In [5]:
df_medianage.isna().sum()

Entity                                                       0
Code                                                      2567
Year                                                         0
Median age - Sex: all - Age: all - Variant: estimates    20145
Median age - Sex: all - Age: all - Variant: medium       18360
dtype: int64

In [6]:
len(df_medianage)

38505

In [7]:
df_medianage_clean = df_medianage.drop(columns=['Median age - Sex: all - Age: all - Variant: medium'])

In [8]:
df_medianage_clean = df_medianage_clean.rename(columns={'Median age - Sex: all - Age: all - Variant: estimates':'median_age', 'Code':'ISO_code_alpha3', 'Entity':'Country'})

In [9]:
df_medianage_clean.head()

       Country ISO_code_alpha3  Year  median_age
0  Afghanistan             AFG  1950        18.4
1  Afghanistan             AFG  1951        18.4
2  Afghanistan             AFG  1952        18.4
3  Afghanistan             AFG  1953        18.3
4  Afghanistan             AFG  1954        18.3

In [10]:
df_medianage_clean = df_medianage_clean[['ISO_code_alpha3', 'Country', 'Year', 'median_age']]

In [11]:
df_medianage_clean

      ISO_code_alpha3      Country  Year  median_age
0                 AFG  Afghanistan  1950        18.4
1                 AFG  Afghanistan  1951        18.4
2                 AFG  Afghanistan  1952        18.4
3                 AFG  Afghanistan  1953        18.3
4                 AFG  Afghanistan  1954        18.3
...               ...          ...   ...         ...
38500             ZWE     Zimbabwe  2096         NaN
38501             ZWE     Zimbabwe  2097         NaN
38502             ZWE     Zimbabwe  2098         NaN
38503             ZWE     Zimbabwe  2099         NaN
38504             ZWE     Zimbabwe  2100         NaN

[38505 rows x 4 columns]

In [12]:
df_medianage_clean.isna().sum()

ISO_code_alpha3     2567
Country                0
Year                   0
median_age         20145
dtype: int64

In [16]:
len(df_medianage_clean)

38505

In [14]:
df_medianage_clean.insert(0, 'id', df_medianage_clean['ISO_code_alpha3'] + '-' + df_medianage_clean['Year'].astype(str))

In [17]:
df_medianage_clean.dtypes

id                  object
ISO_code_alpha3     object
Country             object
Year                 int64
median_age         float64
dtype: object

In [19]:
df_medianage_clean.head()

         id ISO_code_alpha3      Country  Year  median_age
0  AFG-1950             AFG  Afghanistan  1950        18.4
1  AFG-1951             AFG  Afghanistan  1951        18.4
2  AFG-1952             AFG  Afghanistan  1952        18.4
3  AFG-1953             AFG  Afghanistan  1953        18.3
4  AFG-1954             AFG  Afghanistan  1954        18.3

In [20]:
df_medianage_clean.to_csv('prepared_owid_median_age_estimates.csv', index=False)